### Характеристики сети:
- Топология
- Скорость
- Стоимость
- Безопасность
- Доступность
- Масштабируемость
- Надёжность

> Маршрутизатор:
> Отвечает за выбора оптимального маршрута для пересылки трафика (пакетов), поступающего на интерфейс, между сетями к месту назначения
> Является специализированным компьютером

### Компоненты сетевых устройств:
- Центральный процессор
- Операционная система
- Память и хранилище данных (ОХУ, ПЗУ, энергонезависимое ОЗУ, флеш-память, жесткий диск)
#### Компоненты маршрутизатора:
- Центральный процессор
- Память, в которой хранятся данные для выполнения инструкций ОС
	- Энергозависимая (при отключении питания содержимое теряется)
		- Оперативная память (RAM) - временное хранение приложений и процессов, данных:
			- Текущая версия IOS
			- Файл текущей конфигурации
			- Таблица маршрутизации и таблица ARP
			- Буфер пакетов
	- Энергонезависимая (содержимое сохраняется)
		- Постоянное запоминающее устройство (ПЗУ) - постоянное хранение данных:
			- Указания по начальной загрузке
			- Базовое ПО для диагностики
			- Версия IOS с ограниченной функциональностью на случай, если маршрутизатору не удастся загрузить полнофункциональную версию IOS
		- Энергонезависимая оперативная память (NVRAM) - постоянное хранение файла загрузочной конфигурации
		- Флеш-память - постоянное хранение данных IOS и прочих системных файлов.
- ОС - Cisco IOS (инициализация системы, выполнение функций маршрутизации и коммутации)

### Задняя панель маршрутизатора (специализированные порты и интерфейсы):
![[Pasted image 20231124205345.png|500]]
- Сдвоенные разъемы eHWIC
- eHWIC 0
- Порт AUX
- Интерфейсы LAN
- USB-порты
- Консоль RJ-45
- Консоль USB mini-B
- Два разъема для карт флеш-памяти объемом 4 ГБ каждая

### Механизмы пересылки пакетов:
- Программная коммутация - расчёты делаются каждый раз, даже в случае решения идентичных проблем
	- _все пакеты_, прибывающие на интерфейс, пересылаются на уровень управления, где ЦП сопоставляет адрес назначения с записью в таблице маршрутизации, определяет выходной интерфейс и пересылает туда пакет
- Быстрая коммутация - расчёты делаются один раз, запоминая ответ для последующих идентичных случаев
	- первый пакет, прибывающий на интерфейс, пересылается на уровень управления, где ЦП ищет совпадение в _кэше быстрой коммутации_. Если совпадение не найдено, пакет проходит программную коммутацию, если найдено, информацию используется повторно. Пакет пересылается на выходной интерфейс
- Cisco Express Forwarding (CEF) - решение каждой из возможных проблем заранее, путем внесения их в электронную таблицу 
	-  CEF создаёт: 
		- 24-портовую __базу данных переадресации (FID)__ - содерж. предварительные просмотры, инф. о следующих переходах (инф. об интерфейсе и 2-м уровне)
		- и __таблицу смежности (Adjacency Table)__ - инициирована не пакетами, а изменениями (напр., в сетевой топологии)
	- Завершение сходимости оного - содержится вся инфа для пересылки пакета

### Устройства должны быть настроены
- IP-адрес - определяет уникальный узел в локальной сети.
- Маска подсети - определяет, к какой подсети относится данное устройство
- Шлюз по-умолчанию - определяет IP-адрес маршрутизатора, на который следует отправлять пакет, если устройство назначения находится вне локальной сети
> Могут быть настроены:
Статически - узлу вручную назначаются верные IP-адрес, маска подсети и шлюз по умолчанию.
Динамически - через DHCP (сервер с помощью протокола динамической конфигурации сетевого узла)

> На маршрутизаторе:
> Шлюз по-умолчанию - шлюз последней надежды

#### [[Подключение к маршрутизатору через консоль]]

> Для удалённого управления устройства требуют IP-адреса
> Коммуникатор не оснащён физическим интерфейсом, которому можно назначит IP-адрес.
> Но можно использовать виртуальный интерфейс - _коммутируемый виртуальный интерфейс SVI_

Настройка коммутатора на интерфейсе SVI (vlan 1): 
```bash
S(config)# interface vlan 1
S(config-if)# ip address 192.168.10.2 255.255.255.0
S(config-if)# no shutdown
...
S(config)# ip default-gateway 192.168.10.1
```
- 192.168.10.2 - 2-й доступный адрес в подсети 192.168.10.0/24
- 192.168.10.1 - адрес шлюза по-умолчанию - 1-й адрес этой же подсети

## Настройка основных параметров маршрутизатора
- Name the device - Имя устройства - отличает устройство от остальных маршрутизаторов
```sh
R(config)# hostname R1
R1(config)#
```
- Secure management access - Защищённый доступ для управления - обеспечивает безопасность:
	- привелегированного режима EXEC (указание секретного пароля), 
	- пользовательского режима EXEC (пароль консольного канала + процедура входа для пользователей (login))
	- и удалённого доступа (пароль виртуального терминала VTY для каналов от 0 до 4 + процедура входа для пользователей (login))
	- шифрация всех открытых паролей
```bash
R(config)# enable secret class
...
R(config)# line console 0
R(config-line)# password cisco
R(config-line)# login
...
R(config)# line vty 0 4
R(config-line)# password cisco
R(config-line)# login
...
R(config)# service password-encryption
```
- Configure a banner - настройка сообщения - обеспечивает получение уведомления о несанкционированном доступен
```bash
R(config)# banner motd $ Authorized Access Only! $
```

### Настройка интерфейсов
#### Коммутаторы (напоминание):
Коммутаторы 2-го уровня поддерживают локальные сети -> оснащены только портами:
- FastEthernet
- GigabitEthernet
#### Маршрутизаторы:
Маршрутизаторы поддерживают локальные и глобальные сети.
Обеспечивают соединение между _разными_ типами сетей.
Семейство Cisco G2 SR:
- 1-2 интегрированных интерфейса GigabitEthernet
- разъёмы для высокоскоростных интерфейсных карт WAN (HWIC) (для поддержания разных типов сетевых интерфейсов)
	- последовательный интерфейс Serial
	- DSL
	- кабельный интерфейс
- __Настройка глобальных индивидуальных IPv6-адресов__ аналогична $=>$ вместо ip - использовать команду ipv6 и указывать маску после IPv6-адреса: _2001:db8:acad:3::2/64_
##### Настройка интерфейса GigabitEthernet
- переход в режим настройки интерфейса
- указание кратного описания интерфейса (до 240 символов)
- настройка ip-адреса и маски подсети для доступа к интерфейсу
- активация интерфейса
```bash
R(config)# interface G0/0
R(config-if)# description Link to LAN 1
R(config-if)# ip address 192.168.10.1 255.255.255.0
R(config-if)# no shutdown
```
##### Настройка интерфейса Serial
- ...
- последовательный кабель с маркировкой DCE на конце следует настраивать с указанием доп.команды _clock rate_
- состояние интерфейса изменится на up после того, как будет настроен связанный с ним другой интерфейс serial
```bash
R(config)# interface S0/0/0
R(config-if)# description Link to R2
R(config-if)# ip address 209.165.200.255 255.255.255.252
R(config-if)# clock rate 128000
R(config-if)# no shutdown
```
##### Настройка интерфейса loopback
__loopback__ - логический интерфейс, считающийся программным интерфейсом, включающийся автоматически
- используется в целях тестирования внутренних процессов маршрутизации, имитируя сеть за пределами маршрутизатора.
- назначаемый ip-адрес - любой, не задействованный другим интерфейсом
- можно создать несколько штук, указывая номер
```bash
R(config)# interface loopback 0
R(config-if)# ip address 10.0.0.1 255.255.255.0
```
#### Проверка настроек интерфейса
- Отображение краткой информации обо всех интерфейсах, их адресах и текущих состояниях:
  ```bash 
  R# show ip interfaces brief
  ```
- Отображение IPv4-информации о конкретном интерфейсе:
```bash
R# show ip interface G0/0 [brief]
```
- Отображение таблицы IPv4-маршрутизации. (_активные интерфейсы должны быть указаны с 2-я связанными с ними записями: С-connected-подключенная сеть; L-local-локальный узел -- административное расстояние маршрута локального узла=0 => маска=/32 (для ipv6/128)_)
```bash
R# show ip route
```
- Отображение команд, настроенных на указанном интерфейсе
```bash
R# show running-config interface G0/0
```
- Информация об интерфейсах, счетчике потока пакетов на устройстве
	```bash
	R# show interfaces
	```

# [[Административное расстояние]]