# Историческая справка
- 1982 - Протокол внешней маршрутизации
- 1985 - IGRP - (cisco) - Протокол внутренней маршрутизации между шлюзами
- 1988 - Протокол RIP-1
- 1989 - OSPFv1 - Алгоритм поиска кратчайшего пути
- 1990 - IS-IS - Протокол маршрутизации промежуточных систем
- 1992 - OSPFv2
- 1992 - EIGRP - Усовершенствованный протокол внутренней маршрутизации между шлюзами
- 1993 - RIPv2 (лучшее соответствует потребностям новых крупных сетей того времени)
- 1995 - BGP-4. BGP - Связь между сетями интернет-провайдеров,  обмен данными между интернет-провайдерами и их крупными частными клиентами
- 1997 - RIPing (IPv6)
- 1999 - OSPFv3 (IPv6)
- 1999 - BGP-MP - Многопротокольные расширения BGP-4 (IPv6)
- 2000 - IP-IP (IPv6)
- 2005 - EIGRP (IPv6)
# Протокол RIP
- Настройка параметров маршрутизации протокола RIP 
  (по-умолчанию при активируется RIP-v1)
```bash
R(config)# router rip
```

- Включение маршрута для той или иной сети для того, чтобы сообщить, какие локальные интерфейсы используются для обмена данными с другими маршрутизаторами, а также какие локально подключенные сети должны быть объявлены этим маршрутизатором всем остальным маршрутизаторам.
```bash
R(config-router)# network сетевой_адрес
```

---
- RIPv1 - протокол __классовой__ маршрутизации для IPv4 
  (вводя 192.168.1.32 IOS автоматически преобразует в _192.168.1.0_)
  - Отключение и удаление настроек протокола RIP:
```bash
R(config)# no router rip
```
-  Отображение текущих настроек протокола маршрутизации IPv4 
	- + Проверка сетей, объявляемых в протоколе RIP на маршрутизаторе R1
```bash
R1# show ip protocols  
```
- Отображение таблицы маршрутизации RIP
```bash
R1# show ip route | begin Gateway
```
---
> Маршрутизатор RIPv1 игнорирует поля RIPv2 в записи маршрута.
#### Включение RIPv2
```bash
R(config)# router rip
R(config-router)# version 2
R(config-router)# ^Z
R# show ip protocols | section Default
```
- Отключение объединения сетей
```bash
R(config-router)# no  auto-summary
R(config-router)# end
```
> Команда конфигурации маршрутизатора passive-interface  _запрещает передачу обновлений_ маршрутизации через интерфейс маршрутизации, но при этом _разрешает объявление сети_ для других маршрутизаторов.
- Запрет передачи обновлений маршрутизации:
```bash
R(config-router)# passive-interfase {g0/0}
R(config-router)# end
```
- Распространение маршрута по умолчанию
```bash
R(config-router)# default-information originate
```
